docs-generated/test-reports/esg/saml/attr/service/impl/2_SAMLAttributeServiceSoapImplTest-out.txt

[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] esg.saml.common.SAMLBuilder: SAML libraries initialized correctly
[DEBUG] esg.saml.attr.service.impl.SAMLAttributeServiceSoapImpl: SOAP request:
<?xml version="1.0" encoding="UTF-8"?><soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
	<soap11:Body>
		<samlp:AttributeQuery xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" ID="9566201b-63ad-4f14-b6c0-6cf6b35a90e0" IssueInstant="2009-07-28T23:07:00.081Z" Version="2.0">
			<saml:Issuer xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" Format="urn:oasis:names:tc:SAML:1.1:nameid-format:x509SubjectName">CN=test.gateway.com, OU=Services, DC=doegrids, DC=org</saml:Issuer>
			<saml:Subject xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
				<saml:NameID Format="urn:esg:openid">Test Openid</saml:NameID>
			</saml:Subject>
			<saml:Attribute xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" FriendlyName="FirstName" Name="urn:esg:first:name" NameFormat="http://www.w3.org/2001/XMLSchema#string"/>
            <saml:Attribute xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" FriendlyName="LastName" Name="urn:esg:last:name" NameFormat="http://www.w3.org/2001/XMLSchema#string"/>
            <saml:Attribute xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" FriendlyName="EmailAddress" Name="urn:esg:email:address" NameFormat="http://www.w3.org/2001/XMLSchema#string"/>
            <saml:Attribute xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" FriendlyName="GroupRole" Name="urn:esg:group:role" NameFormat="http://www.w3.org/2001/XMLSchema#string"/>
		</samlp:AttributeQuery>
	</soap11:Body>
</soap11:Envelope>

[DEBUG] esg.saml.attr.service.impl.SAMLAttributeServiceSoapImpl: SOAP response:
<?xml version="1.0" encoding="UTF-8"?><soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
   <soap11:Body>
      <samlp:Response xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" InResponseTo="9566201b-63ad-4f14-b6c0-6cf6b35a90e0" Version="2.0">
         <saml:Issuer xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" Format="urn:oasis:names:tc:SAML:1.1:nameid-format:x509SubjectName">Test SAML Issuer</saml:Issuer>
         <samlp:Status>
            <samlp:StatusCode Value="urn:oasis:names:tc:SAML:2.0:status:Success"/>
         </samlp:Status>
         <saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" Version="2.0">
            <saml:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:x509SubjectName">Test SAML Issuer</saml:Issuer>
            <saml:Subject>
               <saml:NameID Format="urn:esg:openid">Test Openid</saml:NameID>
            </saml:Subject>
            <saml:AttributeStatement>
               <saml:Attribute FriendlyName="FirstName" Name="urn:esg:first:name" NameFormat="http://www.w3.org/2001/XMLSchema#string">
                  <saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Test First Name</saml:AttributeValue>
               </saml:Attribute>
               <saml:Attribute FriendlyName="LastName" Name="urn:esg:last:name" NameFormat="http://www.w3.org/2001/XMLSchema#string">
                  <saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Test Last Name</saml:AttributeValue>
               </saml:Attribute>
               <saml:Attribute FriendlyName="EmailAddress" Name="urn:esg:email:address" NameFormat="http://www.w3.org/2001/XMLSchema#string">
                  <saml:AttributeValue xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Test Email</saml:AttributeValue>
               </saml:Attribute>
               <saml:Attribute FriendlyName="GroupRole" Name="urn:esg:group:role" NameFormat="groupRole">
                  <saml:AttributeValue>
                     <esg:groupRole xmlns:esg="http://www.esg.org" group="TestGroup" role="default"/>
                  </saml:AttributeValue>
               </saml:Attribute>
            </saml:AttributeStatement>
         </saml:Assertion>
      </samlp:Response>
   </soap11:Body>
</soap11:Envelope>


